# 使用 brew bundle dump --describe --force --file="~/brewfile" 可以產生說明
tap "bigwig-club/brew"
tap "buo/cask-upgrade"
tap "dart-lang/dart"
#tap "homebrew/bundle"
#tap "homebrew/services"
tap "lihaoyun6/tap"
tap "sass/sass"
tap "koekeishiya/formulae"
# Distributed revision control system
brew "git"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Bitwarden是一款自由且開源的密碼管理服務，使用者可在加密的保管庫中儲存敏感資訊（例如網站登入憑據）
brew "bitwarden"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Fish completion for brew-cask
brew "brew-cask-completion"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: :changed
# Prepare CD image files so they compress better
brew "ecm"
# yabai - Tiling window manager
#cask "yabai"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Collection of GNU find, xargs, and locate
brew "findutils"
# X.Org: Font package creation/installation utilities
# brew "font-util" comment 20251216
# Command-line fuzzy finder written in Go
brew "fzf"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
#trash-cli - Record + restore removed files
brew "trash-cli"
# Colorize logfiles and command output
brew "grc"
# Fulltext search engine and column store
brew "groonga"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Improved top (interactive process viewer)
brew "htop"
#ttygif：将终端录制转化为GIF动画的神器 - CSDN部落客
brew "ttygif"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Modular IRC client
brew "irssi"
# Full featured terminal-based screen editor
brew "joe"
#zoxide - Easy navigation (better cd)
brew "zoxide"
# task - Todo + task management
brew "task"
#lazydocker - Full Docker management app
#lazygit - Full Git managemtne app
# Lightweight and flexible command-line JSON processor
brew "jq"
# Conversion library
brew "libiconv"
# YAML Parser
brew "libyaml"
# Keep your Mac's application settings in sync
brew "mackup"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: :changed
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# ranger - Directory browser
brew "ranger"
# tmux - Term multiplexer
brew "tmux"
#exiftool - Reading and writing exif metadata
brew "exiftool"
#https://github.com/mjolnirapp/AppGrid
#Pandoc - Universal file converter
brew "pandoc"
# Yabai WM
brew "yabai"
# Ambitious Vim-fork focused on extensibility and agility
# Google Gemini CLI
brew "gemini-cli"
#brew "neovim"
#Synfig Studio - 2D animation
cask "Synfigstudio"
# Open source continuous file synchronization application
cask "syncthing"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Simplified-traditional Chinese conversion tool
brew "opencc"
# Open source suite of directory software
brew "openldap"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Implementation of Telnet and SSH
brew "putty"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Open-source database for the realtime web
brew "rethinkdb"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Version control system designed to be a better CVS
brew "subversion"
# Tool to build, change, and version infrastructure
brew "terraform"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Download YouTube videos from the command-line It was disabled on 2024-11-23.
#brew "youtube-dl"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Stylesheet Preprocessor
brew "sass"
# skhd - Hotkey daemon for macOS
brew "skhd"
#lporg - Backup and restore launchpad layout
# Acrobat Reader
cask "adobe-acrobat-reader"
#cask "lporg"
# 直接從蘋果伺服器下載所需的操作系統
cask "mist"
#hiddenbar - 隱藏/顯示煩人的功能表欄圖示
cask "hiddenbar"
# copyq - Clipboard manager (cross platform)
cask "copyq"
# espanso - Live text expander (cross-platform)
cask "espanso"
# finicky - Website-specific default browser 可以指定某些連結利用某些瀏覽器開啟
# cask "finicky"
# Download Instagram photos, accounts, hashtags and locations
cask "4k-stogram"
# Free video downloader
# cask "4k-video-downloader"
# Free video downloader
cask "4k-video-downloader+"
# Turn YouTube links into MP3 files
cask "4k-youtube-to-mp3"
# Finder button, opens directory in terminal
cask "openinterminal"
# Create and modify subtitles
cask "aegisub"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# 
cask "dockdoor"
# docker
cask "docker"
# All in one MacOS management CLI app
brew "m-cli"
#Popup options for text on highlight 
cask "popclip"
# shottr - Better screenshot utility
cask "shottr"
# App to measure storage read/write performance
# cask "amorphousdiskmark"
# Allows connection to a computer remotely
# cask "anydesk"

# pronotes
cask "pronotes"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# User-friendly GUI app for Homebrew
cask "applite"
# Chromium based browser
cask "arc"
# Online gaming platform
cask "battle-net"
# Utility to create and modify archives
cask "betterzip"
# Compare files and folders
cask "beyond-compare"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Screen recording software
cask "cap"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Two-panel file manager
cask "commander-one"
# Grab and tweak the colours you see on your screen
cask "couleurs"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Open terminal quickly from Finder
cask "findergo"
# Flip clock screensaver
cask "fliqlo"
# Screen colour temperature controller
cask "flux"

cask "font-belleza"
cask "font-calistoga"
cask "font-comic-shanns-mono-nerd-font"
cask "font-dancing-script"
cask "font-geologica"
cask "font-glow-sans-tc-extended"
cask "font-glow-sans-tc-normal"
cask "font-hack"
cask "font-sarasa-gothic"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans-tc"
cask "font-ibm-plex-sans-sc"
cask "font-ibm-plex-sans-jp"
cask "font-ibm-plex-sans-kr"
cask "font-maple-mono-nf-cn"
cask "font-inconsolata"
cask "font-harmonyos-san"
cask "font-harmonyos-sans-naskh-arabic"
cask "font-harmonyos-sans-sc"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-ipafont"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-maple-mono-nf"
cask "font-jetbrains-maple-mono"
cask "font-jf-open-huninn"
cask "font-josefin-sans"
cask "font-josefin-slab"
cask "font-lxgw-bright"
cask "font-lxgw-bright-gb"
cask "font-lxgw-bright-tc"
cask "font-lxgw-wenkai-lite"
cask "font-lxgw-wenkai-tc"
cask "font-m-plus-1"
cask "font-m-plus-1-code"
cask "font-m-plus-1p"
cask "font-m-plus-2"
cask "font-maple-mono-cn"
cask "font-maple-mono-nf-cn"
cask "font-meslo-lg-nerd-font"
cask "font-montserrat"
cask "font-montserrat-alternates"
cask "font-montserrat-subrayada"
cask "font-mulish"
cask "font-noto-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-chorasmian"
cask "font-noto-sans-cjk"
cask "font-noto-serif-cjk"
cask "font-nunito"
cask "font-nunito-sans"
cask "font-oswald"
cask "font-playfair-display"
cask "font-playfair-display-sc"
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
cask "font-poppins"
cask "font-quicksand"
cask "font-raleway"
cask "font-roboto"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-symbols-only-nerd-font"
cask "font-zen-maru-gothic"
cask "font-m-plus-rounded-1c"
cask "font-jetbrains-maple-mono"
cask "font-jetbrains-maple-mono-nf"
cask "font-wdxl-lubrifont-tc"
cask "font-chiron-goround-tc"
cask "font-chiron-hei-hk"
cask "font-chiron-sung-hk"
cask "comfyui"
# Tool that helps teams design every part of the product experience
cask "framer"
# Messaging app for WhatsApp, Facebook Messenger, Slack, Telegram and more
cask "franz"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# App for managing Android devices
cask "handshaker"
# Note-taking tool for visual learning
cask "heptabase"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Open-source screen recorder built with web technology
cask "kap"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Find shortcuts for any installed application
cask "keyclu"
# Free and open-source media player
cask "kodi"
# Encryption-focused open source note taking application
#cask "laverna"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Window manager
cask "loop"
# Drop any files to any devices on your LAN
cask "landrop"
# Trims video and audio files losslessly
cask "losslesscut"
# Clipboard manager
# cask "maccy"
# Open-source Markdown editor
cask "macdown"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Extensible two-pane file manager
cask "marta"
#cask "mdimagesizemdimporter"
# Multi-platform web browser
cask "microsoft-edge"
# App to create and edit MKV videos
cask "mkvtools"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# macwhisper
cask "macwhisper"
# Read, annotate and manage ePub books
cask "neat-reader"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
#cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Note taking app
cask "nvalt"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Organise all your reference images in one place
cask "ogdesign-eagle"
# System and utility switches
cask "only-switch"
# Retro video game emulation
cask "openemu@experimental"
# Cross-platform video editor
cask "openshot-video-editor"
# Colour picker for colours onscreen
cask "pika"
# VPN client focusing on security
cask "protonvpn"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
#cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# A lightweight and high-performance screen recorder for macOS.
cask "quickrecorder"
# Control your tools with a few keystrokes
cask "raycast"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Emoji picker optimised for blind people
cask "rocket"
# Free and open-source page layout program
cask "scribus"
# File sharing app
cask "send-anywhere"
# MySQL/MariaDB database management platform
cask "sequel-ace"
# Video editor
cask "shotcut"
# React client for Simplenote
cask "simplenote"
# Utility to resize and position application windows
cask "sizeup"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease disabled on 2024-12-16.
#cask "spectacle"
# Music streaming service
cask "spotify"
# Run anything at startup by simply placing it in a special folder (sonoma or later)
cask "startupfolder"
# Video game digital distribution service
cask "steam"
# Application for inspecting installer packages
cask "suspicious-package"
# App to switch hosts
cask "switchhosts"
cask "switchkey"
# Remote access and connectivity software focused on security
## cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# General-purpose text editor
cask "textmate"
# Unpacks archive files
cask "the-unarchiver"
# Utility to hide the notch
cask "topnotch"
# Web browser focusing on security
cask "tor-browser"
# Configurable document editor that supports Markdown
#cask "typora"
cask "upic"
# AI image upscaler
cask "upscayl"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Instagram client
cask "vu"
# Quick Look plugin for webp files
cask "webpquicklook"
# BBS client
cask "welly"
# Notetaking tool
cask "workflowy"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
mas "Amphetamine", id: 937984704
mas "Anybox", id: 1593408455
mas "DeskMinder", id: 6740942938
mas "Disk Speed Test", id: 425264550
mas "FileSumo Pro", id: 1182711853
mas "Folder Slice", id: 6736857712
mas "HiddenMe", id: 467040476
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MenubarX", id: 1575588022
mas "Numbers", id: 409203825
mas "OmmWriter", id: 412347921
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "QuickKey", id: 1142743710
mas "QuickLinks", id: 1200685619
mas "Sleeve", id: 1606145041
mas "Squash", id: 1152443474
mas "ToothFairy", id: 1191449274
mas "Xcode", id: 497799835
mas "簡放島", id: 6529528324
mas "amorphousdiskmark", id: 1168254295
mas "Hidden Bar", id: 1452453066
vscode "aaron-bond.better-comments"
vscode "aestudio.tailwind-skeleton-generator"
vscode "agavram.github-vscode-theme-minimal"
vscode "anbuselvanrocky.bootstrap5-vscode"
vscode "antfu.slidev"
vscode "austenc.tailwind-docs"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "budparr.language-hugo-vscode"
vscode "charleswan.markdown-toc"
vscode "christian-kohler.path-intellisense"
vscode "danielgjackson.auto-dark-mode-windows"
vscode "davidanson.vscode-markdownlint"
vscode "devrashed.go-responsive"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eliostruyf.vscode-front-matter"
vscode "enskylin.gitbook-shelf"
vscode "esbenp.prettier-vscode"
vscode "estevesegura.svgl"
vscode "fivethree.vscode-hugo-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "gitbook.gitbook-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "goessner.mdmath"
vscode "gruntfuggly.todo-tree"
vscode "hansuxdev.bootstrap5-snippets"
vscode "hoyt-tian.gitbook-kit"
vscode "huibizhang.codesnap-plus"
vscode "idleberg.icon-fonts"
vscode "jeff-hykin.polacode-2019"
vscode "jgclark.vscode-todo-highlight"
vscode "jock.svg"
vscode "kaellarkin.hugo-shortcode-syntax"
vscode "lightyen.vscode-fanhuaji"
vscode "lior-chamla.google-fonts"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "mushan.vscode-paste-image"
vscode "natizyskunk.sftp"
vscode "noahbeij.marp-codecafe-snippets"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robole.markdown-snippets"
vscode "ryannaddy.laravel-artisan"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "simonsiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "starbist.clamp-it"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabbyml.vscode-tabby"
vscode "tehnix.vscode-tidymarkdown"
vscode "thekalinga.bootstrap4-vscode"
vscode "tomoki1207.pdf"
vscode "tootone.org-mode"
vscode "toxblh.polacode-fork"
vscode "ue.alphabetical-sorter"
vscode "usernamehw.errorlens"
vscode "ysemeniuk.emmet-live"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zaczero.bootstrap-v4-snippets"
vscode "zignd.html-css-class-completion"
