tap "bigwig-club/brew"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Fish completion for brew-cask
brew "brew-cask-completion"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Prepare CD image files so they compress better
brew "ecm"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Collection of GNU find, xargs, and locate
brew "findutils"
# X.Org: Font package creation/installation utilities
brew "font-util"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Colorize logfiles and command output
brew "grc"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Modular IRC client
brew "irssi"
# Full featured terminal-based screen editor
brew "joe"
# Note taking and to-do application with synchronization capabilities
# brew "joplin-cli"
# Conversion library
brew "libiconv"
# YAML Parser
brew "libyaml"
# Keep your Mac's application settings in sync
brew "mackup"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: true
# Mac App Store command-line interface
brew "mas"
# Matroska media files manipulation tools
brew "mkvtoolnix", link: false
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# Manage multiple Node.js versions
brew "nvm"
# Simplified-traditional Chinese conversion tool
brew "opencc"
# Open source suite of directory software
brew "openldap"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Implementation of Telnet and SSH
brew "putty"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Open-source database for the realtime web
brew "rethinkdb"
# Display and control your Android device
brew "scrcpy"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Tool to build, change, and version infrastructure
brew "terraform"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Download Instagram photos, accounts, hashtags and locations
cask "4k-stogram"
# Free video downloader
cask "4k-video-downloader"
# Turn YouTube links into MP3 files
cask "4k-youtube-to-mp3"
# Create and modify subtitles
cask "aegisub"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# App to measure storage read/write performance
cask "amorphousdiskmark"
# Android SDK component
# cask "android-platform-tools"
# Allows connection to a computer remotely
cask "anydesk"
# Application uninstaller
cask "appcleaner"
# Cloud storage service
cask "baidunetdisk"
# Online gaming platform
cask "battle-net"
# Utility to create and modify archives
cask "betterzip"
# Compare files and folders
cask "beyond-compare"
# Desktop password and login vault
# cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Two-panel file manager
cask "commander-one"
# Grab and tweak the colours you see on your screen
cask "couleurs"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Outlining app for your work
cask "dynalist"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Collaborative team software
cask "figma"
# Open terminal quickly from Finder
cask "findergo"
# Web browser
cask "firefox-developer-edition"
# Flip clock screensaver
cask "fliqlo"
# Screen color temperature controller
cask "flux"
# Time tracker
cask "focus-booster"
# Framer
cask "framer"
# Heptabase
cask "heptabase"
# Arc browser
cask "arc"
# 小麥注音
# cask "McBopomofo"
# Eagle - 圖片收藏及管理必備工具 https://eagle.cool 
cask "ogdesign-eagle"
# Developer targeted fonts with a high number of glyphs
cask "font-comic-shanns-mono-nerd-font"
cask "font-geologica"
cask "font-hack"
# Corporate typeface for IBM
cask "font-ibm-plex"
cask "font-inconsolata"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-term-nerd-font"
cask "font-ipafont"
cask "font-jf-open-huninn"
cask "font-josefin-sans"
cask "font-josefin-slab"
# Merged font of Ysabeau Office and LXGW WenKai Lite
cask "font-lxgw-bright"
# Merged font of Ysabeau Office and LXGW WenKai GB
cask "font-lxgw-bright-gb"
# Merged font of Ysabeau Office and LXGW WenKai TC
cask "font-lxgw-bright-tc"
# Open-source Chinese font derived from Fontworks' Klee One
cask "font-lxgw-wenkai-lite"
# Open-source traditional Chinese font derived from Fontworks' Klee One
cask "font-lxgw-wenkai-tc"
cask "font-m-plus-1"
cask "font-m-plus-1-code"
cask "font-m-plus-1p"
cask "font-m-plus-2"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Minimalist sans serif typeface, designed for both display and text typography
cask "font-mulish"
# Developer targeted fonts with a high number of glyphs
cask "font-noto-nerd-font"
cask "font-noto-sans"
# Design for the historical middle eastern chorasmian script
cask "font-noto-sans-chorasmian"
cask "font-noto-sans-cjk"
cask "font-noto-serif-cjk"
# Japanese programming font synthesized from IBM Plex Mono and IBM Plex Sans JP
cask "font-plemol-jp"
# Japanese programming font synthesized from IBM Plex Mono and IBM Plex Sans JP
cask "font-plemol-jp-hs"
# Japanese programming font synthesized from IBM Plex Mono and IBM Plex Sans JP
cask "font-plemol-jp-nf"
# Japanese programming font synthesized from IBM Plex Mono and IBM Plex Sans JP
## cask "font-plemol-jp-nfj"
cask "font-quicksand"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
# Messaging app for WhatsApp, Facebook Messenger, Slack, Telegram and more
cask "franz"
# Free and open-source image editor
cask "gimp"
#cask "gitter"
# Game client
#cask "gog-galaxy"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# App for managing Android devices
cask "handshaker"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# File archiver
cask "keka"
# Free and open-source media player
cask "kodi"
cask "laverna"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Trims video and audio files losslessly
cask "losslesscut"
# Clipboard manager
cask "maccy"
# Open-source Markdown editor
cask "macdown"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Fork of Nylas Mail
# cask "mailspring"
# Markdown editor
cask "mark-text"
# Extensible two-pane file manager
cask "marta"
# Input method for Bopomofo (Phonetic Symbols of Mandarin Chinese)
# cask "mcbopomofo"
# Web browser
cask "microsoft-edge"
# App to create and edit MKV videos
cask "mkvtools"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Note taking app
cask "nvalt"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Retro video game emulation
cask "openemu@experimental"
# Cross-platform video editor
cask "openshot-video-editor"
# VPN client focusing on security
# cask "protonvpn"
# Peer to peer Bitorrent client
cask "qbittorrent"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Control your tools with a few keystrokes
cask "raycast"
# Screencasting software
cask "recordit"
# Emoji picker optimized for blind people
cask "rocket"
# Free and open-source page layout program
cask "scribus"
# File sharing app
cask "send-anywhere"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video editor
cask "shotcut"
# losslesscut
cask "losslesscut"
# React client for Simplenote
cask "simplenote"
# Utility to resize and position application windows
cask "sizeup"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Code source explorer
# cask "sourcetrail"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
# cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# App to switch hosts
cask "switchhosts"
cask "switchkey"
# Messaging app with a focus on speed and security
cask "telegram"
# General-purpose text editor
cask "textmate"
# Unpacks archive files
cask "the-unarchiver"
# Flexible level editor
# cask "tiled"
# Web browser focusing on security
cask "tor-browser"
# Configurable document editor that supports Markdown
# cask "typora"
cask "upic"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Note-taking platform
cask "vnote"
# Instagram client
cask "vu"
cask "webpquicklook"
# JavaScript IDE
# cask "webstorm"
# BBS client
cask "welly"
# Notetaking tool
cask "workflowy"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Apowersoft Screen Recorder", id: 1030681467
mas "Disk Speed Test", id: 425264550
# mas "EzyCal", id: 1190243926
mas "FileSumo Pro", id: 1182711853
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "OmmWriter", id: 412347921
mas "Pages", id: 409201541
mas "QuickKey", id: 1142743710
mas "QuickLinks", id: 1200685619
mas "Squash", id: 1152443474
mas "ToothFairy", id: 1191449274
mas "Xcode", id: 497799835
